Tekla.Structures.DialogInternal.AttributeInfo
Represents an attribute in the collection of the Tekla.Structures.DialogInternal.AttributeManager.

Tekla.Structures.DialogInternal.AttributeInfo.Name
Gets the name of the attribute.

Tekla.Structures.DialogInternal.AttributeInfo.ValueType
Gets the type of the attribute value.

Tekla.Structures.DialogInternal.AttributeInfo.Value
Gets or sets the attribute value.

Tekla.Structures.DialogInternal.AttributeInfo.HasFilter
Gets a value indicating whether this attribute has a filter.

Tekla.Structures.DialogInternal.AttributeInfo.FilterValue
Gets or sets the state of the filter (enabled/disabled).
Returns null if the attribute does not have a filter.
Throws System.InvalidOperationException:
Set filter value when attribute does not have filter.
Throws System.ArgumentNullException: value is null

Tekla.Structures.DialogInternal.AttributeInfo.BindValueControl(System.Windows.Forms.Control,System.String,System.Windows.Forms.DataSourceUpdateMode)
Binds the attribute value with the control.
Ctrl: The control instance to bind.
PropertyName: The name of the control property to bind.
UpdateMode: When changes to the control property are propagated to the data source.

Tekla.Structures.DialogInternal.AttributeInfo.BindFilterControl(System.Windows.Forms.Control,System.String,System.Windows.Forms.DataSourceUpdateMode)
Binds the attribute filter with the control.
Ctrl: The control instance to bind.
PropertyName: The name of the control property to bind.
UpdateMode: When changes to the control property are propagated to the data source.